# running in checks/src/
read -formal picorv32.v
prep -top picorv32

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
